<a href="https://colab.research.google.com/github/Hu-nie/9th_Data_Engineering_Starter_Kit/blob/main/(DE_9%EA%B8%B0)_2%EC%A3%BC%EC%B0%A8_SQL_%EC%8B%A4%EC%8A%B5_hunie.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

주피터 SQL 엔진 설정

In [ ]:
%load_ext sql

In [ ]:
# ID와 PW를 자신의 환경에 맞게 수정
%sql postgresql://guest:Guest1234@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev

'Connected: guest@dev'

In [ ]:
#숙제입니다 !!!
%%sql

SELECT to_char(st.ts, 'YYYY-MM') date, COUNT(usc.userID)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 1
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-05', 6261),
 ('2019-06', 10520),
 ('2019-07', 14840),
 ('2019-08', 17151),
 ('2019-09', 15790),
 ('2019-10', 18899),
 ('2019-11', 18059)]

다양한 SELECT 실행해보기

In [ ]:
%%sql SELECT COUNT(1)
FROM raw_data.user_session_channel;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(101520,)]

In [ ]:
%%sql

SELECT COUNT(1)
FROM raw_data.session_timestamp;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(101520,)]

In [ ]:
%%sql

SELECT *
FROM raw_data.session_timestamp
LIMIT 1

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[('0002ac0d783338cfeab0b2bdbd872cda',)]

In [ ]:
%%sql

SELECT DATE(ts) yearmonthday, sessionID
FROM raw_data.session_timestamp
LIMIT 10;

In [ ]:
%%sql

SELECT DATE(ts) date, sessionID
FROM raw_data.session_timestamp
ORDER BY ts desc
LIMIT 10;

In [ ]:
%%sql

SELECT DATE(ts) date, COUNT(sessionID) -- COUNT(1)
FROM raw_data.session_timestamp
GROUP BY 1 
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 10, 18), 630),
 (datetime.date(2019, 7, 6), 435),
 (datetime.date(2019, 11, 2), 556),
 (datetime.date(2019, 7, 23), 526),
 (datetime.date(2019, 8, 1), 499),
 (datetime.date(2019, 10, 12), 619),
 (datetime.date(2019, 11, 13), 671),
 (datetime.date(2019, 11, 6), 610),
 (datetime.date(2019, 9, 13), 543),
 (datetime.date(2019, 8, 18), 529)]

In [ ]:
%%sql

SELECT DATE(ts) date, COUNT(sessionID)
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10;

In [ ]:
%%sql

SELECT DATE(ts) date, COUNT(sessionID)
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 1
LIMIT 10; -- DESC

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 5, 1), 147),
 (datetime.date(2019, 5, 2), 161),
 (datetime.date(2019, 5, 3), 150),
 (datetime.date(2019, 5, 4), 142),
 (datetime.date(2019, 5, 5), 144),
 (datetime.date(2019, 5, 6), 164),
 (datetime.date(2019, 5, 7), 180),
 (datetime.date(2019, 5, 8), 161),
 (datetime.date(2019, 5, 9), 169),
 (datetime.date(2019, 5, 10), 176)]

JOIN에 대해 배워보자. 일별 방문 유니크한 사용자의 수를 계산하고 싶다면?

In [ ]:
# raw_data.user_session_channel과 raw_data.session_timestamp 테이블의 조인이 필요
%%sql

SELECT DATE(st.ts) yearmonth, COUNT(DISTINCT usc.userID)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 10, 21), 549),
 (datetime.date(2019, 10, 14), 541),
 (datetime.date(2019, 10, 11), 539),
 (datetime.date(2019, 10, 23), 535),
 (datetime.date(2019, 10, 29), 535),
 (datetime.date(2019, 10, 10), 533),
 (datetime.date(2019, 10, 8), 532),
 (datetime.date(2019, 10, 22), 529),
 (datetime.date(2019, 10, 18), 528),
 (datetime.date(2019, 10, 15), 526)]

In [ ]:
# raw_data.user_session_channel과 raw_data.session_timestamp 테이블의 조인이 필요
%%sql

SELECT to_char(st.ts, 'YYYY-MM') date, COUNT(usc.userID) -- 세션수 카운트와 동일. COUNT(NULL): 0, 그 이외의 모든 경우는 1을 리턴

FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID

GROUP BY 1
ORDER BY 1
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-05', 6261),
 ('2019-06', 10520),
 ('2019-07', 14840),
 ('2019-08', 17151),
 ('2019-09', 15790),
 ('2019-10', 18899),
 ('2019-11', 18059)]

In [ ]:
# raw_data.user_session_channel과 raw_data.session_timestamp 테이블의 조인이 필요
%%sql

SELECT * -- 세션수 카운트와 동일. COUNT(NULL): 0, 그 이외의 모든 경우는 1을 리턴
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID

LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[('0004289ee1c7b8b08c77e19878106ae3', datetime.datetime(2019, 11, 16, 21, 20, 14, 447000), 1651, '0004289ee1c7b8b08c77e19878106ae3', 'Organic'),
 ('00053f5e11d1fe4e49a221165b39abc9', datetime.datetime(2019, 6, 24, 13, 4, 26, 370000), 1197, '00053f5e11d1fe4e49a221165b39abc9', 'Facebook'),
 ('00056c20eb5a029583db75506953f1d9', datetime.datetime(2019, 9, 26, 14, 50, 17), 1401, '00056c20eb5a029583db75506953f1d9', 'Facebook'),
 ('00063cb5da1826febf178b669eea3250', datetime.datetime(2019, 10, 16, 14, 4, 42, 797000), 1399, '00063cb5da1826febf178b669eea3250', 'Facebook'),
 ('000958fdaefe0dd06f5d7c4e4a5f28d1', datetime.datetime(2019, 11, 2, 14, 52, 30, 183000), 1667, '000958fdaefe0dd06f5d7c4e4a5f28d1', 'Instagram'),
 ('000a3f777828d2cdbee98887561aa130', datetime.datetime(2019, 11, 29, 16, 33, 55), 468, '000a3f777828d2cdbee98887561aa130', 'Facebook'),
 ('000cb7efa8a05429dd5309b4bea2eb0c', datetime.datetime(2019, 7, 23, 13, 39, 28), 1563, '000cb7efa8a05429dd5309b4bea2eb0c', 'Naver'),
 ('00106ac9184e7d54b570d0f0cb0c38b2', datetime.datetime(2019, 7, 25, 18, 14, 43, 37000), 711, '00106ac9184e7d54b570d0f0cb0c38b2', 'Organic'),
 ('0011df6282fe8cf78feeab676fbc3c27', datetime.datetime(2019, 11, 2, 21, 10, 41), 473, '0011df6282fe8cf78feeab676fbc3c27', 'Naver'),
 ('00126b47d5502dfb7d01f750ad23d813', datetime.datetime(2019, 6, 15, 15, 35, 48, 483000), 420, '00126b47d5502dfb7d01f750ad23d813', 'Facebook')]

In [ ]:
%%sql

SELECT channel, count(st.sessionID)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 1

In [ ]:
%%sql

SELECT COUNT(1)
FROM raw_data.user_session_channel 
WHERE channel ilike '%o%'

판다스와 연동하는 방법

In [ ]:
result = %sql SELECT * FROM raw_data.user_session_channel
df = result.DataFrame()

In [ ]:
df.head()

In [ ]:
df.groupby(["channel"]).size()

In [ ]:
df.groupby(["channel"])["sessionid"].count()

In [ ]:
result = %sql SELECT * FROM raw_data.session_timestamp
df_st = result.DataFrame()

In [ ]:
df_st['date'] = df_st['ts'].apply(lambda x: "%d-%02d-%02d" % (x.year, x.month, x.day))

In [ ]:
df_st.head()

In [ ]:
df_st.groupby(["date"]).size()  # .sort_values(["date"])

In [ ]:
df_st.groupby(["date"])["sessionid"].count().reset_index(name='count').sort_values("date", ascending=False)